---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FabricationPart
source: html/3d147be9-68c0-c944-4c38-950d9cfe6fdb.htm
---
# FabricationPart Members

Add custom data type to the fabrication part. The new data gets the default value defined by the fabrication configuration.